[
    {
        "text": "The teacher is extremely unhelpful and unapproachable."
    },
    {
        "text": "Classes are dreadfully boring and monotonous."
    },
    {
        "text": "The teacher's explanations are confusing and unclear."
    },
    {
        "text": "Assignments are overly challenging and unreasonable."
    },
    {
        "text": "The teacher shows favoritism and unfair grading."
    },
    {
        "text": "Lectures are too fast-paced and hard to follow."
    },
    {
        "text": "The teacher lacks enthusiasm and passion for teaching."
    },
    {
        "text": "Feedback on assignments is minimal and unhelpful."
    },
    {
        "text": "The teacher is disorganized and inconsistent."
    },
    {
        "text": "Exams are overly difficult and not representative of the material taught."
    },
    {
        "text": "The teacher's teaching style is outdated and ineffective."
    },
    {
        "text": "The classroom environment is unwelcoming and negative."
    },
    {
        "text": "The teacher is often absent or late to class."
    },
    {
        "text": "The teacher does not provide adequate resources for learning."
    },
    {
        "text": "The teacher is unresponsive to student inquiries and emails."
    },
    {
        "text": "The teacher lacks empathy and understanding towards students."
    },
    {
        "text": "The teacher is overly critical and discouraging."
    },
    {
        "text": "The teacher does not encourage student participation."
    },
    {
        "text": "The teacher's grading system is arbitrary and unfair."
    },
    {
        "text": "The teacher is uninterested and apathetic towards students' progress."
    },
    {
        "text": "The teacher lacks clarity in explaining concepts."
    },
    {
        "text": "The teacher does not create an inclusive learning environment."
    },
    {
        "text": "The teacher does not respect students' time and schedules."
    },
    {
        "text": "The teacher does not value student feedback or opinions."
    },
    {
        "text": "The teacher's lectures are uninspiring and uninsightful."
    },
    {
        "text": "The teacher does not adapt teaching methods to different learning styles."
    },
    {
        "text": "The teacher does not provide constructive criticism on assignments."
    },
    {
        "text": "The teacher is unapproachable and intimidating."
    },
    {
        "text": "The teacher does not foster a collaborative learning environment."
    },
    {
        "text": "The teacher's instructions are confusing and contradictory."
    },
    {
        "text": "The teacher does not address student concerns or questions adequately."
    },
    {
        "text": "The teacher does not offer extra help or support outside of class."
    },
    {
        "text": "The teacher's attitude towards students is condescending and dismissive."
    },
    {
        "text": "The teacher's assignments do not align with course objectives."
    },
    {
        "text": "The teacher does not provide clear expectations for assignments and exams."
    },
    {
        "text": "The teacher's communication with students is ineffective and unresponsive."
    },
    {
        "text": "The teacher does not create a positive and encouraging learning environment."
    },
    {
        "text": "The teacher's grading is inconsistent and subjective."
    },
    {
        "text": "The teacher does not value student input or participation in class."
    },
    {
        "text": "The teacher's teaching methods are outdated and ineffective."
    },
    {
        "text": "The teacher's feedback on assignments is unhelpful and discouraging."
    },
    {
        "text": "The teacher's lack of organization affects the quality of learning."
    },
    {
        "text": "The teacher's lectures are unengaging and uninspiring."
    },
    {
        "text": "The teacher does not provide adequate support for struggling students."
    },
    {
        "text": "The teacher's attitude towards students is demoralizing and negative."
    },
    {
        "text": "The teacher's approach to teaching is rigid and inflexible."
    },
    {
        "text": "The teacher's expectations for students are unrealistic and unattainable."
    },
    {
        "text": "The teacher's lack of preparation affects the quality of instruction."
    }
]
