"{\"class_name\": \"Tokenizer\", \"config\": {\"num_words\": null, \"filters\": \"!\\\"#$%&()*+,-./:;<=>?@[\\\\]^_`{|}~\\t\\n\", \"lower\": true, \"split\": \" \", \"char_level\": false, \"oov_token\": null, \"document_count\": 412, \"word_counts\": \"{\\\"hi\\\": 1, \\\"how\\\": 22, \\\"are\\\": 25, \\\"you\\\": 35, \\\"is\\\": 78, \\\"anyone\\\": 1, \\\"there\\\": 12, \\\"hello\\\": 1, \\\"good\\\": 4, \\\"day\\\": 2, \\\"what's\\\": 1, \\\"up\\\": 2, \\\"ya\\\": 1, \\\"heyy\\\": 1, \\\"whatsup\\\": 1, \\\"cya\\\": 1, \\\"see\\\": 2, \\\"bye\\\": 3, \\\"later\\\": 2, \\\"goodbye\\\": 1, \\\"i\\\": 16, \\\"am\\\": 3, \\\"leaving\\\": 1, \\\"have\\\": 11, \\\"a\\\": 3, \\\"talk\\\": 1, \\\"to\\\": 14, \\\"ttyl\\\": 1, \\\"got\\\": 1, \\\"go\\\": 1, \\\"gtg\\\": 1, \\\"what\\\": 58, \\\"the\\\": 49, \\\"name\\\": 18, \\\"of\\\": 33, \\\"your\\\": 15, \\\"developers\\\": 5, \\\"creators\\\": 4, \\\"who\\\": 14, \\\"created\\\": 2, \\\"made\\\": 3, \\\"by\\\": 2, \\\"whom\\\": 1, \\\"create\\\": 1, \\\"designed\\\": 1, \\\"do\\\": 12, \\\"called\\\": 1, \\\"should\\\": 4, \\\"call\\\": 4, \\\"whats\\\": 3, \\\"this\\\": 1, \\\"chatting\\\": 1, \\\"taking\\\": 1, \\\"timing\\\": 7, \\\"college\\\": 71, \\\"working\\\": 1, \\\"days\\\": 1, \\\"when\\\": 12, \\\"guys\\\": 2, \\\"open\\\": 3, \\\"hours\\\": 3, \\\"operation\\\": 1, \\\"about\\\": 13, \\\"on\\\": 3, \\\"saturday\\\": 1, \\\"tell\\\": 7, \\\"something\\\": 2, \\\"come\\\": 1, \\\"attend\\\": 1, \\\"my\\\": 1, \\\"time\\\": 3, \\\"more\\\": 1, \\\"info\\\": 2, \\\"contact\\\": 5, \\\"telephone\\\": 1, \\\"number\\\": 9, \\\"no\\\": 3, \\\"phone\\\": 4, \\\"can\\\": 14, \\\"get\\\": 4, \\\"list\\\": 9, \\\"courses\\\": 12, \\\"offered\\\": 5, \\\"in\\\": 29, \\\"univrsity\\\": 1, \\\"uni\\\": 8, \\\"offer\\\": 1, \\\"branches\\\": 5, \\\"available\\\": 8, \\\"at\\\": 6, \\\"me\\\": 11, \\\"computer\\\": 8, \\\"engineering\\\": 12, \\\"it\\\": 9, \\\"information\\\": 8, \\\"technology\\\": 2, \\\"ai\\\": 2, \\\"ml\\\": 2, \\\"mechanical\\\": 4, \\\"chemical\\\": 4, \\\"civil\\\": 4, \\\"fee\\\": 8, \\\"per\\\": 2, \\\"semester\\\": 8, \\\"each\\\": 4, \\\"fees\\\": 17, \\\"year\\\": 7, \\\"much\\\": 2, \\\"for\\\": 26, \\\"first\\\": 2, \\\"hostel\\\": 24, \\\"ac\\\": 6, \\\"room\\\": 6, \\\"non\\\": 3, \\\"girls\\\": 2, \\\"boys\\\": 2, \\\"where\\\": 13, \\\"located\\\": 3, \\\"address\\\": 7, \\\"reach\\\": 2, \\\"location\\\": 3, \\\"wheres\\\": 1, \\\"facility\\\": 8, \\\"servive\\\": 1, \\\"facilities\\\": 9, \\\"does\\\": 6, \\\"provide\\\": 3, \\\"any\\\": 8, \\\"capacity\\\": 1, \\\"far\\\": 1, \\\"from\\\": 1, \\\"distance\\\": 3, \\\"big\\\": 1, \\\"between\\\": 2, \\\"and\\\": 4, \\\"events\\\": 9, \\\"organised\\\": 2, \\\"conducted\\\": 2, \\\"event\\\": 1, \\\"held\\\": 1, \\\"functions\\\": 1, \\\"document\\\": 3, \\\"bring\\\": 2, \\\"documents\\\": 10, \\\"needed\\\": 4, \\\"admision\\\": 2, \\\"admission\\\": 13, \\\"during\\\": 2, \\\"required\\\": 4, \\\"which\\\": 2, \\\"need\\\": 2, \\\"size\\\": 2, \\\"campus\\\": 1, \\\"building\\\": 2, \\\"many\\\": 4, \\\"floors\\\": 4, \\\"tall\\\": 1, \\\"uni's\\\": 1, \\\"syllabus\\\": 5, \\\"timetable\\\": 8, \\\"next\\\": 1, \\\"lecture\\\": 1, \\\"library\\\": 11, \\\"books\\\": 2, \\\"book\\\": 1, \\\"libraries\\\": 1, \\\"infrastructure\\\": 4, \\\"food\\\": 5, \\\"canteen\\\": 9, \\\"cafetaria\\\": 3, \\\"menu\\\": 2, \\\"foods\\\": 1, \\\"we\\\": 3, \\\"variety\\\": 1, \\\"eat\\\": 1, \\\"placement\\\": 3, \\\"companies\\\": 3, \\\"visit\\\": 2, \\\"average\\\": 1, \\\"package\\\": 2, \\\"recruitment\\\": 1, \\\"hod\\\": 15, \\\"extc\\\": 4, \\\"principal\\\": 6, \\\"whatv\\\": 1, \\\"principal's\\\": 1, \\\"office\\\": 1, \\\"exam\\\": 8, \\\"dates\\\": 2, \\\"schedule\\\": 1, \\\"sem\\\": 1, \\\"process\\\": 4, \\\"take\\\": 1, \\\"scholarship\\\": 25, \\\"ce\\\": 1, \\\"scholarships\\\": 1, \\\"comps\\\": 1, \\\"automobile\\\": 1, \\\"second\\\": 1, \\\"third\\\": 1, \\\"fourth\\\": 1, \\\"provided\\\": 1, \\\"max\\\": 1, \\\"students\\\": 2, \\\"seats\\\": 4, \\\"branch\\\": 3, \\\"maximum\\\": 2, \\\"intake\\\": 2, \\\"stundent\\\": 1, \\\"taken\\\": 1, \\\"seat\\\": 1, \\\"allotment\\\": 1, \\\"dress\\\": 1, \\\"code\\\": 1, \\\"dresscode\\\": 1, \\\"uniform\\\": 6, \\\"wear\\\": 2, \\\"casuals\\\": 1, \\\"an\\\": 1, \\\"different\\\": 2, \\\"committe\\\": 1, \\\"committee\\\": 5, \\\"give\\\": 2, \\\"details\\\": 2, \\\"love\\\": 2, \\\"will\\\": 4, \\\"marry\\\": 1, \\\"fuck\\\": 1, \\\"bitch\\\": 1, \\\"shut\\\": 1, \\\"hell\\\": 1, \\\"stupid\\\": 1, \\\"idiot\\\": 1, \\\"dumb\\\": 1, \\\"ass\\\": 1, \\\"asshole\\\": 1, \\\"fucker\\\": 1, \\\"holidays\\\": 5, \\\"starts\\\": 1, \\\"end\\\": 1, \\\"holiday\\\": 2, \\\"these\\\": 1, \\\"vacations\\\": 1, \\\"vacation\\\": 2, \\\"long\\\": 1, \\\"be\\\": 1, \\\"sports\\\": 7, \\\"games\\\": 2, \\\"activities\\\": 1, \\\"please\\\": 1, \\\"okk\\\": 1, \\\"okie\\\": 1, \\\"nice\\\": 1, \\\"work\\\": 2, \\\"well\\\": 1, \\\"done\\\": 2, \\\"job\\\": 1, \\\"thanks\\\": 2, \\\"help\\\": 2, \\\"thank\\\": 1, \\\"its\\\": 1, \\\"ok\\\": 2, \\\"k\\\": 1, \\\"okay\\\": 1, \\\"thing\\\": 1, \\\"things\\\": 1, \\\"u\\\": 2, \\\"why\\\": 1, \\\"use\\\": 1, \\\"ragging\\\": 8, \\\"practice\\\": 1, \\\"active\\\": 1, \\\"antiragging\\\": 2, \\\"cases\\\": 1, \\\"here\\\": 1, \\\"against\\\": 1, \\\"juniors\\\": 1, \\\"history\\\": 1, \\\"incidents\\\": 1, \\\"mess\\\": 2, \\\"table\\\": 1, \\\"bus\\\": 2, \\\"academic\\\": 1, \\\"calander\\\": 1}\", \"word_docs\": \"{\\\"hi\\\": 1, \\\"you\\\": 35, \\\"are\\\": 25, \\\"how\\\": 22, \\\"anyone\\\": 1, \\\"there\\\": 12, \\\"is\\\": 78, \\\"hello\\\": 1, \\\"day\\\": 2, \\\"good\\\": 4, \\\"up\\\": 2, \\\"what's\\\": 1, \\\"ya\\\": 1, \\\"heyy\\\": 1, \\\"whatsup\\\": 1, \\\"cya\\\": 1, \\\"see\\\": 2, \\\"bye\\\": 2, \\\"later\\\": 2, \\\"goodbye\\\": 1, \\\"i\\\": 16, \\\"am\\\": 3, \\\"leaving\\\": 1, \\\"have\\\": 11, \\\"a\\\": 3, \\\"talk\\\": 1, \\\"to\\\": 14, \\\"ttyl\\\": 1, \\\"go\\\": 1, \\\"got\\\": 1, \\\"gtg\\\": 1, \\\"your\\\": 15, \\\"of\\\": 33, \\\"developers\\\": 5, \\\"name\\\": 18, \\\"what\\\": 58, \\\"the\\\": 47, \\\"creators\\\": 4, \\\"created\\\": 2, \\\"who\\\": 14, \\\"by\\\": 2, \\\"made\\\": 3, \\\"whom\\\": 1, \\\"create\\\": 1, \\\"designed\\\": 1, \\\"do\\\": 12, \\\"called\\\": 1, \\\"call\\\": 4, \\\"should\\\": 4, \\\"whats\\\": 3, \\\"this\\\": 1, \\\"chatting\\\": 1, \\\"taking\\\": 1, \\\"timing\\\": 7, \\\"college\\\": 70, \\\"working\\\": 1, \\\"days\\\": 1, \\\"open\\\": 3, \\\"guys\\\": 2, \\\"when\\\": 12, \\\"hours\\\": 3, \\\"operation\\\": 1, \\\"about\\\": 13, \\\"on\\\": 3, \\\"saturday\\\": 1, \\\"something\\\": 2, \\\"tell\\\": 7, \\\"come\\\": 1, \\\"attend\\\": 1, \\\"my\\\": 1, \\\"time\\\": 3, \\\"more\\\": 1, \\\"info\\\": 2, \\\"contact\\\": 5, \\\"telephone\\\": 1, \\\"number\\\": 9, \\\"no\\\": 3, \\\"phone\\\": 4, \\\"can\\\": 14, \\\"get\\\": 4, \\\"list\\\": 9, \\\"courses\\\": 12, \\\"offered\\\": 5, \\\"in\\\": 29, \\\"univrsity\\\": 1, \\\"uni\\\": 8, \\\"offer\\\": 1, \\\"branches\\\": 5, \\\"available\\\": 8, \\\"at\\\": 6, \\\"me\\\": 11, \\\"computer\\\": 8, \\\"engineering\\\": 12, \\\"it\\\": 9, \\\"information\\\": 8, \\\"technology\\\": 2, \\\"ai\\\": 2, \\\"ml\\\": 2, \\\"mechanical\\\": 4, \\\"chemical\\\": 4, \\\"civil\\\": 4, \\\"fee\\\": 8, \\\"semester\\\": 8, \\\"per\\\": 2, \\\"each\\\": 4, \\\"year\\\": 7, \\\"fees\\\": 17, \\\"much\\\": 2, \\\"for\\\": 22, \\\"first\\\": 2, \\\"hostel\\\": 24, \\\"room\\\": 6, \\\"ac\\\": 6, \\\"non\\\": 3, \\\"girls\\\": 2, \\\"boys\\\": 2, \\\"where\\\": 13, \\\"located\\\": 3, \\\"address\\\": 7, \\\"reach\\\": 2, \\\"location\\\": 3, \\\"wheres\\\": 1, \\\"facility\\\": 8, \\\"servive\\\": 1, \\\"facilities\\\": 9, \\\"provide\\\": 3, \\\"does\\\": 6, \\\"any\\\": 8, \\\"capacity\\\": 1, \\\"from\\\": 1, \\\"far\\\": 1, \\\"distance\\\": 3, \\\"big\\\": 1, \\\"between\\\": 2, \\\"and\\\": 4, \\\"events\\\": 9, \\\"organised\\\": 2, \\\"conducted\\\": 2, \\\"event\\\": 1, \\\"held\\\": 1, \\\"functions\\\": 1, \\\"document\\\": 3, \\\"bring\\\": 2, \\\"documents\\\": 10, \\\"admision\\\": 2, \\\"needed\\\": 4, \\\"admission\\\": 13, \\\"during\\\": 2, \\\"required\\\": 4, \\\"which\\\": 2, \\\"need\\\": 2, \\\"size\\\": 2, \\\"campus\\\": 1, \\\"building\\\": 2, \\\"floors\\\": 4, \\\"many\\\": 4, \\\"tall\\\": 1, \\\"uni's\\\": 1, \\\"syllabus\\\": 5, \\\"timetable\\\": 8, \\\"next\\\": 1, \\\"lecture\\\": 1, \\\"library\\\": 11, \\\"books\\\": 2, \\\"book\\\": 1, \\\"libraries\\\": 1, \\\"infrastructure\\\": 4, \\\"food\\\": 5, \\\"canteen\\\": 9, \\\"cafetaria\\\": 3, \\\"menu\\\": 2, \\\"we\\\": 3, \\\"foods\\\": 1, \\\"variety\\\": 1, \\\"eat\\\": 1, \\\"placement\\\": 3, \\\"companies\\\": 3, \\\"visit\\\": 2, \\\"package\\\": 2, \\\"average\\\": 1, \\\"recruitment\\\": 1, \\\"hod\\\": 15, \\\"extc\\\": 4, \\\"principal\\\": 6, \\\"whatv\\\": 1, \\\"principal's\\\": 1, \\\"office\\\": 1, \\\"dates\\\": 2, \\\"exam\\\": 8, \\\"schedule\\\": 1, \\\"sem\\\": 1, \\\"process\\\": 4, \\\"take\\\": 1, \\\"scholarship\\\": 25, \\\"ce\\\": 1, \\\"scholarships\\\": 1, \\\"comps\\\": 1, \\\"automobile\\\": 1, \\\"second\\\": 1, \\\"third\\\": 1, \\\"fourth\\\": 1, \\\"provided\\\": 1, \\\"students\\\": 2, \\\"max\\\": 1, \\\"seats\\\": 4, \\\"branch\\\": 3, \\\"maximum\\\": 2, \\\"intake\\\": 2, \\\"taken\\\": 1, \\\"stundent\\\": 1, \\\"allotment\\\": 1, \\\"seat\\\": 1, \\\"code\\\": 1, \\\"dress\\\": 1, \\\"dresscode\\\": 1, \\\"uniform\\\": 6, \\\"wear\\\": 2, \\\"casuals\\\": 1, \\\"an\\\": 1, \\\"different\\\": 2, \\\"committe\\\": 1, \\\"committee\\\": 5, \\\"details\\\": 2, \\\"give\\\": 2, \\\"love\\\": 2, \\\"will\\\": 4, \\\"marry\\\": 1, \\\"fuck\\\": 1, \\\"bitch\\\": 1, \\\"shut\\\": 1, \\\"hell\\\": 1, \\\"stupid\\\": 1, \\\"idiot\\\": 1, \\\"dumb\\\": 1, \\\"ass\\\": 1, \\\"asshole\\\": 1, \\\"fucker\\\": 1, \\\"holidays\\\": 5, \\\"starts\\\": 1, \\\"end\\\": 1, \\\"these\\\": 1, \\\"holiday\\\": 2, \\\"vacations\\\": 1, \\\"vacation\\\": 2, \\\"long\\\": 1, \\\"be\\\": 1, \\\"sports\\\": 7, \\\"games\\\": 2, \\\"activities\\\": 1, \\\"please\\\": 1, \\\"okk\\\": 1, \\\"okie\\\": 1, \\\"nice\\\": 1, \\\"work\\\": 2, \\\"done\\\": 2, \\\"well\\\": 1, \\\"job\\\": 1, \\\"help\\\": 2, \\\"thanks\\\": 2, \\\"thank\\\": 1, \\\"ok\\\": 2, \\\"its\\\": 1, \\\"k\\\": 1, \\\"okay\\\": 1, \\\"thing\\\": 1, \\\"things\\\": 1, \\\"u\\\": 2, \\\"why\\\": 1, \\\"use\\\": 1, \\\"ragging\\\": 8, \\\"practice\\\": 1, \\\"active\\\": 1, \\\"antiragging\\\": 2, \\\"cases\\\": 1, \\\"here\\\": 1, \\\"against\\\": 1, \\\"juniors\\\": 1, \\\"history\\\": 1, \\\"incidents\\\": 1, \\\"mess\\\": 2, \\\"table\\\": 1, \\\"bus\\\": 2, \\\"calander\\\": 1, \\\"academic\\\": 1}\", \"index_docs\": \"{\\\"163\\\": 1, \\\"5\\\": 35, \\\"9\\\": 25, \\\"12\\\": 22, \\\"164\\\": 1, \\\"24\\\": 12, \\\"1\\\": 78, \\\"165\\\": 1, \\\"110\\\": 2, \\\"69\\\": 4, \\\"111\\\": 2, \\\"166\\\": 1, \\\"167\\\": 1, \\\"168\\\": 1, \\\"169\\\": 1, \\\"170\\\": 1, \\\"112\\\": 2, \\\"89\\\": 2, \\\"113\\\": 2, \\\"171\\\": 1, \\\"15\\\": 16, \\\"90\\\": 3, \\\"172\\\": 1, \\\"29\\\": 11, \\\"91\\\": 3, \\\"173\\\": 1, \\\"18\\\": 14, \\\"174\\\": 1, \\\"176\\\": 1, \\\"175\\\": 1, \\\"177\\\": 1, \\\"16\\\": 15, \\\"6\\\": 33, \\\"61\\\": 5, \\\"13\\\": 18, \\\"3\\\": 58, \\\"4\\\": 47, \\\"70\\\": 4, \\\"114\\\": 2, \\\"19\\\": 14, \\\"115\\\": 2, \\\"92\\\": 3, \\\"178\\\": 1, \\\"179\\\": 1, \\\"180\\\": 1, \\\"25\\\": 12, \\\"181\\\": 1, \\\"72\\\": 4, \\\"71\\\": 4, \\\"93\\\": 3, \\\"182\\\": 1, \\\"183\\\": 1, \\\"184\\\": 1, \\\"50\\\": 7, \\\"2\\\": 70, \\\"185\\\": 1, \\\"186\\\": 1, \\\"94\\\": 3, \\\"116\\\": 2, \\\"26\\\": 12, \\\"95\\\": 3, \\\"187\\\": 1, \\\"21\\\": 13, \\\"96\\\": 3, \\\"188\\\": 1, \\\"117\\\": 2, \\\"51\\\": 7, \\\"189\\\": 1, \\\"190\\\": 1, \\\"191\\\": 1, \\\"97\\\": 3, \\\"192\\\": 1, \\\"118\\\": 2, \\\"62\\\": 5, \\\"193\\\": 1, \\\"33\\\": 9, \\\"98\\\": 3, \\\"73\\\": 4, \\\"20\\\": 14, \\\"74\\\": 4, \\\"34\\\": 9, \\\"27\\\": 12, \\\"63\\\": 5, \\\"7\\\": 29, \\\"194\\\": 1, \\\"39\\\": 8, \\\"195\\\": 1, \\\"64\\\": 5, \\\"40\\\": 8, \\\"55\\\": 6, \\\"30\\\": 11, \\\"41\\\": 8, \\\"28\\\": 12, \\\"35\\\": 9, \\\"42\\\": 8, \\\"119\\\": 2, \\\"120\\\": 2, \\\"121\\\": 2, \\\"75\\\": 4, \\\"76\\\": 4, \\\"77\\\": 4, \\\"43\\\": 8, \\\"44\\\": 8, \\\"122\\\": 2, \\\"78\\\": 4, \\\"52\\\": 7, \\\"14\\\": 17, \\\"123\\\": 2, \\\"8\\\": 22, \\\"124\\\": 2, \\\"11\\\": 24, \\\"57\\\": 6, \\\"56\\\": 6, \\\"99\\\": 3, \\\"125\\\": 2, \\\"126\\\": 2, \\\"22\\\": 13, \\\"100\\\": 3, \\\"53\\\": 7, \\\"127\\\": 2, \\\"101\\\": 3, \\\"196\\\": 1, \\\"45\\\": 8, \\\"197\\\": 1, \\\"36\\\": 9, \\\"102\\\": 3, \\\"58\\\": 6, \\\"46\\\": 8, \\\"198\\\": 1, \\\"200\\\": 1, \\\"199\\\": 1, \\\"103\\\": 3, \\\"201\\\": 1, \\\"128\\\": 2, \\\"79\\\": 4, \\\"37\\\": 9, \\\"129\\\": 2, \\\"130\\\": 2, \\\"202\\\": 1, \\\"203\\\": 1, \\\"204\\\": 1, \\\"104\\\": 3, \\\"131\\\": 2, \\\"32\\\": 10, \\\"132\\\": 2, \\\"80\\\": 4, \\\"23\\\": 13, \\\"133\\\": 2, \\\"81\\\": 4, \\\"134\\\": 2, \\\"135\\\": 2, \\\"136\\\": 2, \\\"205\\\": 1, \\\"137\\\": 2, \\\"83\\\": 4, \\\"82\\\": 4, \\\"206\\\": 1, \\\"207\\\": 1, \\\"65\\\": 5, \\\"47\\\": 8, \\\"208\\\": 1, \\\"209\\\": 1, \\\"31\\\": 11, \\\"138\\\": 2, \\\"210\\\": 1, \\\"211\\\": 1, \\\"84\\\": 4, \\\"66\\\": 5, \\\"38\\\": 9, \\\"105\\\": 3, \\\"139\\\": 2, \\\"106\\\": 3, \\\"212\\\": 1, \\\"213\\\": 1, \\\"214\\\": 1, \\\"107\\\": 3, \\\"108\\\": 3, \\\"140\\\": 2, \\\"141\\\": 2, \\\"215\\\": 1, \\\"216\\\": 1, \\\"17\\\": 15, \\\"85\\\": 4, \\\"59\\\": 6, \\\"217\\\": 1, \\\"218\\\": 1, \\\"219\\\": 1, \\\"142\\\": 2, \\\"48\\\": 8, \\\"220\\\": 1, \\\"221\\\": 1, \\\"86\\\": 4, \\\"222\\\": 1, \\\"10\\\": 25, \\\"223\\\": 1, \\\"224\\\": 1, \\\"225\\\": 1, \\\"226\\\": 1, \\\"227\\\": 1, \\\"228\\\": 1, \\\"229\\\": 1, \\\"230\\\": 1, \\\"143\\\": 2, \\\"231\\\": 1, \\\"87\\\": 4, \\\"109\\\": 3, \\\"144\\\": 2, \\\"145\\\": 2, \\\"233\\\": 1, \\\"232\\\": 1, \\\"235\\\": 1, \\\"234\\\": 1, \\\"237\\\": 1, \\\"236\\\": 1, \\\"238\\\": 1, \\\"60\\\": 6, \\\"146\\\": 2, \\\"239\\\": 1, \\\"240\\\": 1, \\\"147\\\": 2, \\\"241\\\": 1, \\\"67\\\": 5, \\\"149\\\": 2, \\\"148\\\": 2, \\\"150\\\": 2, \\\"88\\\": 4, \\\"242\\\": 1, \\\"243\\\": 1, \\\"244\\\": 1, \\\"245\\\": 1, \\\"246\\\": 1, \\\"247\\\": 1, \\\"248\\\": 1, \\\"249\\\": 1, \\\"250\\\": 1, \\\"251\\\": 1, \\\"252\\\": 1, \\\"68\\\": 5, \\\"253\\\": 1, \\\"254\\\": 1, \\\"255\\\": 1, \\\"151\\\": 2, \\\"256\\\": 1, \\\"152\\\": 2, \\\"257\\\": 1, \\\"258\\\": 1, \\\"54\\\": 7, \\\"153\\\": 2, \\\"259\\\": 1, \\\"260\\\": 1, \\\"261\\\": 1, \\\"262\\\": 1, \\\"263\\\": 1, \\\"154\\\": 2, \\\"155\\\": 2, \\\"264\\\": 1, \\\"265\\\": 1, \\\"157\\\": 2, \\\"156\\\": 2, \\\"266\\\": 1, \\\"158\\\": 2, \\\"267\\\": 1, \\\"268\\\": 1, \\\"269\\\": 1, \\\"270\\\": 1, \\\"271\\\": 1, \\\"159\\\": 2, \\\"272\\\": 1, \\\"273\\\": 1, \\\"49\\\": 8, \\\"274\\\": 1, \\\"275\\\": 1, \\\"160\\\": 2, \\\"276\\\": 1, \\\"277\\\": 1, \\\"278\\\": 1, \\\"279\\\": 1, \\\"280\\\": 1, \\\"281\\\": 1, \\\"161\\\": 2, \\\"282\\\": 1, \\\"162\\\": 2, \\\"284\\\": 1, \\\"283\\\": 1}\", \"index_word\": \"{\\\"1\\\": \\\"is\\\", \\\"2\\\": \\\"college\\\", \\\"3\\\": \\\"what\\\", \\\"4\\\": \\\"the\\\", \\\"5\\\": \\\"you\\\", \\\"6\\\": \\\"of\\\", \\\"7\\\": \\\"in\\\", \\\"8\\\": \\\"for\\\", \\\"9\\\": \\\"are\\\", \\\"10\\\": \\\"scholarship\\\", \\\"11\\\": \\\"hostel\\\", \\\"12\\\": \\\"how\\\", \\\"13\\\": \\\"name\\\", \\\"14\\\": \\\"fees\\\", \\\"15\\\": \\\"i\\\", \\\"16\\\": \\\"your\\\", \\\"17\\\": \\\"hod\\\", \\\"18\\\": \\\"to\\\", \\\"19\\\": \\\"who\\\", \\\"20\\\": \\\"can\\\", \\\"21\\\": \\\"about\\\", \\\"22\\\": \\\"where\\\", \\\"23\\\": \\\"admission\\\", \\\"24\\\": \\\"there\\\", \\\"25\\\": \\\"do\\\", \\\"26\\\": \\\"when\\\", \\\"27\\\": \\\"courses\\\", \\\"28\\\": \\\"engineering\\\", \\\"29\\\": \\\"have\\\", \\\"30\\\": \\\"me\\\", \\\"31\\\": \\\"library\\\", \\\"32\\\": \\\"documents\\\", \\\"33\\\": \\\"number\\\", \\\"34\\\": \\\"list\\\", \\\"35\\\": \\\"it\\\", \\\"36\\\": \\\"facilities\\\", \\\"37\\\": \\\"events\\\", \\\"38\\\": \\\"canteen\\\", \\\"39\\\": \\\"uni\\\", \\\"40\\\": \\\"available\\\", \\\"41\\\": \\\"computer\\\", \\\"42\\\": \\\"information\\\", \\\"43\\\": \\\"fee\\\", \\\"44\\\": \\\"semester\\\", \\\"45\\\": \\\"facility\\\", \\\"46\\\": \\\"any\\\", \\\"47\\\": \\\"timetable\\\", \\\"48\\\": \\\"exam\\\", \\\"49\\\": \\\"ragging\\\", \\\"50\\\": \\\"timing\\\", \\\"51\\\": \\\"tell\\\", \\\"52\\\": \\\"year\\\", \\\"53\\\": \\\"address\\\", \\\"54\\\": \\\"sports\\\", \\\"55\\\": \\\"at\\\", \\\"56\\\": \\\"ac\\\", \\\"57\\\": \\\"room\\\", \\\"58\\\": \\\"does\\\", \\\"59\\\": \\\"principal\\\", \\\"60\\\": \\\"uniform\\\", \\\"61\\\": \\\"developers\\\", \\\"62\\\": \\\"contact\\\", \\\"63\\\": \\\"offered\\\", \\\"64\\\": \\\"branches\\\", \\\"65\\\": \\\"syllabus\\\", \\\"66\\\": \\\"food\\\", \\\"67\\\": \\\"committee\\\", \\\"68\\\": \\\"holidays\\\", \\\"69\\\": \\\"good\\\", \\\"70\\\": \\\"creators\\\", \\\"71\\\": \\\"should\\\", \\\"72\\\": \\\"call\\\", \\\"73\\\": \\\"phone\\\", \\\"74\\\": \\\"get\\\", \\\"75\\\": \\\"mechanical\\\", \\\"76\\\": \\\"chemical\\\", \\\"77\\\": \\\"civil\\\", \\\"78\\\": \\\"each\\\", \\\"79\\\": \\\"and\\\", \\\"80\\\": \\\"needed\\\", \\\"81\\\": \\\"required\\\", \\\"82\\\": \\\"many\\\", \\\"83\\\": \\\"floors\\\", \\\"84\\\": \\\"infrastructure\\\", \\\"85\\\": \\\"extc\\\", \\\"86\\\": \\\"process\\\", \\\"87\\\": \\\"seats\\\", \\\"88\\\": \\\"will\\\", \\\"89\\\": \\\"bye\\\", \\\"90\\\": \\\"am\\\", \\\"91\\\": \\\"a\\\", \\\"92\\\": \\\"made\\\", \\\"93\\\": \\\"whats\\\", \\\"94\\\": \\\"open\\\", \\\"95\\\": \\\"hours\\\", \\\"96\\\": \\\"on\\\", \\\"97\\\": \\\"time\\\", \\\"98\\\": \\\"no\\\", \\\"99\\\": \\\"non\\\", \\\"100\\\": \\\"located\\\", \\\"101\\\": \\\"location\\\", \\\"102\\\": \\\"provide\\\", \\\"103\\\": \\\"distance\\\", \\\"104\\\": \\\"document\\\", \\\"105\\\": \\\"cafetaria\\\", \\\"106\\\": \\\"we\\\", \\\"107\\\": \\\"placement\\\", \\\"108\\\": \\\"companies\\\", \\\"109\\\": \\\"branch\\\", \\\"110\\\": \\\"day\\\", \\\"111\\\": \\\"up\\\", \\\"112\\\": \\\"see\\\", \\\"113\\\": \\\"later\\\", \\\"114\\\": \\\"created\\\", \\\"115\\\": \\\"by\\\", \\\"116\\\": \\\"guys\\\", \\\"117\\\": \\\"something\\\", \\\"118\\\": \\\"info\\\", \\\"119\\\": \\\"technology\\\", \\\"120\\\": \\\"ai\\\", \\\"121\\\": \\\"ml\\\", \\\"122\\\": \\\"per\\\", \\\"123\\\": \\\"much\\\", \\\"124\\\": \\\"first\\\", \\\"125\\\": \\\"girls\\\", \\\"126\\\": \\\"boys\\\", \\\"127\\\": \\\"reach\\\", \\\"128\\\": \\\"between\\\", \\\"129\\\": \\\"organised\\\", \\\"130\\\": \\\"conducted\\\", \\\"131\\\": \\\"bring\\\", \\\"132\\\": \\\"admision\\\", \\\"133\\\": \\\"during\\\", \\\"134\\\": \\\"which\\\", \\\"135\\\": \\\"need\\\", \\\"136\\\": \\\"size\\\", \\\"137\\\": \\\"building\\\", \\\"138\\\": \\\"books\\\", \\\"139\\\": \\\"menu\\\", \\\"140\\\": \\\"visit\\\", \\\"141\\\": \\\"package\\\", \\\"142\\\": \\\"dates\\\", \\\"143\\\": \\\"students\\\", \\\"144\\\": \\\"maximum\\\", \\\"145\\\": \\\"intake\\\", \\\"146\\\": \\\"wear\\\", \\\"147\\\": \\\"different\\\", \\\"148\\\": \\\"give\\\", \\\"149\\\": \\\"details\\\", \\\"150\\\": \\\"love\\\", \\\"151\\\": \\\"holiday\\\", \\\"152\\\": \\\"vacation\\\", \\\"153\\\": \\\"games\\\", \\\"154\\\": \\\"work\\\", \\\"155\\\": \\\"done\\\", \\\"156\\\": \\\"thanks\\\", \\\"157\\\": \\\"help\\\", \\\"158\\\": \\\"ok\\\", \\\"159\\\": \\\"u\\\", \\\"160\\\": \\\"antiragging\\\", \\\"161\\\": \\\"mess\\\", \\\"162\\\": \\\"bus\\\", \\\"163\\\": \\\"hi\\\", \\\"164\\\": \\\"anyone\\\", \\\"165\\\": \\\"hello\\\", \\\"166\\\": \\\"what's\\\", \\\"167\\\": \\\"ya\\\", \\\"168\\\": \\\"heyy\\\", \\\"169\\\": \\\"whatsup\\\", \\\"170\\\": \\\"cya\\\", \\\"171\\\": \\\"goodbye\\\", \\\"172\\\": \\\"leaving\\\", \\\"173\\\": \\\"talk\\\", \\\"174\\\": \\\"ttyl\\\", \\\"175\\\": \\\"got\\\", \\\"176\\\": \\\"go\\\", \\\"177\\\": \\\"gtg\\\", \\\"178\\\": \\\"whom\\\", \\\"179\\\": \\\"create\\\", \\\"180\\\": \\\"designed\\\", \\\"181\\\": \\\"called\\\", \\\"182\\\": \\\"this\\\", \\\"183\\\": \\\"chatting\\\", \\\"184\\\": \\\"taking\\\", \\\"185\\\": \\\"working\\\", \\\"186\\\": \\\"days\\\", \\\"187\\\": \\\"operation\\\", \\\"188\\\": \\\"saturday\\\", \\\"189\\\": \\\"come\\\", \\\"190\\\": \\\"attend\\\", \\\"191\\\": \\\"my\\\", \\\"192\\\": \\\"more\\\", \\\"193\\\": \\\"telephone\\\", \\\"194\\\": \\\"univrsity\\\", \\\"195\\\": \\\"offer\\\", \\\"196\\\": \\\"wheres\\\", \\\"197\\\": \\\"servive\\\", \\\"198\\\": \\\"capacity\\\", \\\"199\\\": \\\"far\\\", \\\"200\\\": \\\"from\\\", \\\"201\\\": \\\"big\\\", \\\"202\\\": \\\"event\\\", \\\"203\\\": \\\"held\\\", \\\"204\\\": \\\"functions\\\", \\\"205\\\": \\\"campus\\\", \\\"206\\\": \\\"tall\\\", \\\"207\\\": \\\"uni's\\\", \\\"208\\\": \\\"next\\\", \\\"209\\\": \\\"lecture\\\", \\\"210\\\": \\\"book\\\", \\\"211\\\": \\\"libraries\\\", \\\"212\\\": \\\"foods\\\", \\\"213\\\": \\\"variety\\\", \\\"214\\\": \\\"eat\\\", \\\"215\\\": \\\"average\\\", \\\"216\\\": \\\"recruitment\\\", \\\"217\\\": \\\"whatv\\\", \\\"218\\\": \\\"principal's\\\", \\\"219\\\": \\\"office\\\", \\\"220\\\": \\\"schedule\\\", \\\"221\\\": \\\"sem\\\", \\\"222\\\": \\\"take\\\", \\\"223\\\": \\\"ce\\\", \\\"224\\\": \\\"scholarships\\\", \\\"225\\\": \\\"comps\\\", \\\"226\\\": \\\"automobile\\\", \\\"227\\\": \\\"second\\\", \\\"228\\\": \\\"third\\\", \\\"229\\\": \\\"fourth\\\", \\\"230\\\": \\\"provided\\\", \\\"231\\\": \\\"max\\\", \\\"232\\\": \\\"stundent\\\", \\\"233\\\": \\\"taken\\\", \\\"234\\\": \\\"seat\\\", \\\"235\\\": \\\"allotment\\\", \\\"236\\\": \\\"dress\\\", \\\"237\\\": \\\"code\\\", \\\"238\\\": \\\"dresscode\\\", \\\"239\\\": \\\"casuals\\\", \\\"240\\\": \\\"an\\\", \\\"241\\\": \\\"committe\\\", \\\"242\\\": \\\"marry\\\", \\\"243\\\": \\\"fuck\\\", \\\"244\\\": \\\"bitch\\\", \\\"245\\\": \\\"shut\\\", \\\"246\\\": \\\"hell\\\", \\\"247\\\": \\\"stupid\\\", \\\"248\\\": \\\"idiot\\\", \\\"249\\\": \\\"dumb\\\", \\\"250\\\": \\\"ass\\\", \\\"251\\\": \\\"asshole\\\", \\\"252\\\": \\\"fucker\\\", \\\"253\\\": \\\"starts\\\", \\\"254\\\": \\\"end\\\", \\\"255\\\": \\\"these\\\", \\\"256\\\": \\\"vacations\\\", \\\"257\\\": \\\"long\\\", \\\"258\\\": \\\"be\\\", \\\"259\\\": \\\"activities\\\", \\\"260\\\": \\\"please\\\", \\\"261\\\": \\\"okk\\\", \\\"262\\\": \\\"okie\\\", \\\"263\\\": \\\"nice\\\", \\\"264\\\": \\\"well\\\", \\\"265\\\": \\\"job\\\", \\\"266\\\": \\\"thank\\\", \\\"267\\\": \\\"its\\\", \\\"268\\\": \\\"k\\\", \\\"269\\\": \\\"okay\\\", \\\"270\\\": \\\"thing\\\", \\\"271\\\": \\\"things\\\", \\\"272\\\": \\\"why\\\", \\\"273\\\": \\\"use\\\", \\\"274\\\": \\\"practice\\\", \\\"275\\\": \\\"active\\\", \\\"276\\\": \\\"cases\\\", \\\"277\\\": \\\"here\\\", \\\"278\\\": \\\"against\\\", \\\"279\\\": \\\"juniors\\\", \\\"280\\\": \\\"history\\\", \\\"281\\\": \\\"incidents\\\", \\\"282\\\": \\\"table\\\", \\\"283\\\": \\\"academic\\\", \\\"284\\\": \\\"calander\\\"}\", \"word_index\": \"{\\\"is\\\": 1, \\\"college\\\": 2, \\\"what\\\": 3, \\\"the\\\": 4, \\\"you\\\": 5, \\\"of\\\": 6, \\\"in\\\": 7, \\\"for\\\": 8, \\\"are\\\": 9, \\\"scholarship\\\": 10, \\\"hostel\\\": 11, \\\"how\\\": 12, \\\"name\\\": 13, \\\"fees\\\": 14, \\\"i\\\": 15, \\\"your\\\": 16, \\\"hod\\\": 17, \\\"to\\\": 18, \\\"who\\\": 19, \\\"can\\\": 20, \\\"about\\\": 21, \\\"where\\\": 22, \\\"admission\\\": 23, \\\"there\\\": 24, \\\"do\\\": 25, \\\"when\\\": 26, \\\"courses\\\": 27, \\\"engineering\\\": 28, \\\"have\\\": 29, \\\"me\\\": 30, \\\"library\\\": 31, \\\"documents\\\": 32, \\\"number\\\": 33, \\\"list\\\": 34, \\\"it\\\": 35, \\\"facilities\\\": 36, \\\"events\\\": 37, \\\"canteen\\\": 38, \\\"uni\\\": 39, \\\"available\\\": 40, \\\"computer\\\": 41, \\\"information\\\": 42, \\\"fee\\\": 43, \\\"semester\\\": 44, \\\"facility\\\": 45, \\\"any\\\": 46, \\\"timetable\\\": 47, \\\"exam\\\": 48, \\\"ragging\\\": 49, \\\"timing\\\": 50, \\\"tell\\\": 51, \\\"year\\\": 52, \\\"address\\\": 53, \\\"sports\\\": 54, \\\"at\\\": 55, \\\"ac\\\": 56, \\\"room\\\": 57, \\\"does\\\": 58, \\\"principal\\\": 59, \\\"uniform\\\": 60, \\\"developers\\\": 61, \\\"contact\\\": 62, \\\"offered\\\": 63, \\\"branches\\\": 64, \\\"syllabus\\\": 65, \\\"food\\\": 66, \\\"committee\\\": 67, \\\"holidays\\\": 68, \\\"good\\\": 69, \\\"creators\\\": 70, \\\"should\\\": 71, \\\"call\\\": 72, \\\"phone\\\": 73, \\\"get\\\": 74, \\\"mechanical\\\": 75, \\\"chemical\\\": 76, \\\"civil\\\": 77, \\\"each\\\": 78, \\\"and\\\": 79, \\\"needed\\\": 80, \\\"required\\\": 81, \\\"many\\\": 82, \\\"floors\\\": 83, \\\"infrastructure\\\": 84, \\\"extc\\\": 85, \\\"process\\\": 86, \\\"seats\\\": 87, \\\"will\\\": 88, \\\"bye\\\": 89, \\\"am\\\": 90, \\\"a\\\": 91, \\\"made\\\": 92, \\\"whats\\\": 93, \\\"open\\\": 94, \\\"hours\\\": 95, \\\"on\\\": 96, \\\"time\\\": 97, \\\"no\\\": 98, \\\"non\\\": 99, \\\"located\\\": 100, \\\"location\\\": 101, \\\"provide\\\": 102, \\\"distance\\\": 103, \\\"document\\\": 104, \\\"cafetaria\\\": 105, \\\"we\\\": 106, \\\"placement\\\": 107, \\\"companies\\\": 108, \\\"branch\\\": 109, \\\"day\\\": 110, \\\"up\\\": 111, \\\"see\\\": 112, \\\"later\\\": 113, \\\"created\\\": 114, \\\"by\\\": 115, \\\"guys\\\": 116, \\\"something\\\": 117, \\\"info\\\": 118, \\\"technology\\\": 119, \\\"ai\\\": 120, \\\"ml\\\": 121, \\\"per\\\": 122, \\\"much\\\": 123, \\\"first\\\": 124, \\\"girls\\\": 125, \\\"boys\\\": 126, \\\"reach\\\": 127, \\\"between\\\": 128, \\\"organised\\\": 129, \\\"conducted\\\": 130, \\\"bring\\\": 131, \\\"admision\\\": 132, \\\"during\\\": 133, \\\"which\\\": 134, \\\"need\\\": 135, \\\"size\\\": 136, \\\"building\\\": 137, \\\"books\\\": 138, \\\"menu\\\": 139, \\\"visit\\\": 140, \\\"package\\\": 141, \\\"dates\\\": 142, \\\"students\\\": 143, \\\"maximum\\\": 144, \\\"intake\\\": 145, \\\"wear\\\": 146, \\\"different\\\": 147, \\\"give\\\": 148, \\\"details\\\": 149, \\\"love\\\": 150, \\\"holiday\\\": 151, \\\"vacation\\\": 152, \\\"games\\\": 153, \\\"work\\\": 154, \\\"done\\\": 155, \\\"thanks\\\": 156, \\\"help\\\": 157, \\\"ok\\\": 158, \\\"u\\\": 159, \\\"antiragging\\\": 160, \\\"mess\\\": 161, \\\"bus\\\": 162, \\\"hi\\\": 163, \\\"anyone\\\": 164, \\\"hello\\\": 165, \\\"what's\\\": 166, \\\"ya\\\": 167, \\\"heyy\\\": 168, \\\"whatsup\\\": 169, \\\"cya\\\": 170, \\\"goodbye\\\": 171, \\\"leaving\\\": 172, \\\"talk\\\": 173, \\\"ttyl\\\": 174, \\\"got\\\": 175, \\\"go\\\": 176, \\\"gtg\\\": 177, \\\"whom\\\": 178, \\\"create\\\": 179, \\\"designed\\\": 180, \\\"called\\\": 181, \\\"this\\\": 182, \\\"chatting\\\": 183, \\\"taking\\\": 184, \\\"working\\\": 185, \\\"days\\\": 186, \\\"operation\\\": 187, \\\"saturday\\\": 188, \\\"come\\\": 189, \\\"attend\\\": 190, \\\"my\\\": 191, \\\"more\\\": 192, \\\"telephone\\\": 193, \\\"univrsity\\\": 194, \\\"offer\\\": 195, \\\"wheres\\\": 196, \\\"servive\\\": 197, \\\"capacity\\\": 198, \\\"far\\\": 199, \\\"from\\\": 200, \\\"big\\\": 201, \\\"event\\\": 202, \\\"held\\\": 203, \\\"functions\\\": 204, \\\"campus\\\": 205, \\\"tall\\\": 206, \\\"uni's\\\": 207, \\\"next\\\": 208, \\\"lecture\\\": 209, \\\"book\\\": 210, \\\"libraries\\\": 211, \\\"foods\\\": 212, \\\"variety\\\": 213, \\\"eat\\\": 214, \\\"average\\\": 215, \\\"recruitment\\\": 216, \\\"whatv\\\": 217, \\\"principal's\\\": 218, \\\"office\\\": 219, \\\"schedule\\\": 220, \\\"sem\\\": 221, \\\"take\\\": 222, \\\"ce\\\": 223, \\\"scholarships\\\": 224, \\\"comps\\\": 225, \\\"automobile\\\": 226, \\\"second\\\": 227, \\\"third\\\": 228, \\\"fourth\\\": 229, \\\"provided\\\": 230, \\\"max\\\": 231, \\\"stundent\\\": 232, \\\"taken\\\": 233, \\\"seat\\\": 234, \\\"allotment\\\": 235, \\\"dress\\\": 236, \\\"code\\\": 237, \\\"dresscode\\\": 238, \\\"casuals\\\": 239, \\\"an\\\": 240, \\\"committe\\\": 241, \\\"marry\\\": 242, \\\"fuck\\\": 243, \\\"bitch\\\": 244, \\\"shut\\\": 245, \\\"hell\\\": 246, \\\"stupid\\\": 247, \\\"idiot\\\": 248, \\\"dumb\\\": 249, \\\"ass\\\": 250, \\\"asshole\\\": 251, \\\"fucker\\\": 252, \\\"starts\\\": 253, \\\"end\\\": 254, \\\"these\\\": 255, \\\"vacations\\\": 256, \\\"long\\\": 257, \\\"be\\\": 258, \\\"activities\\\": 259, \\\"please\\\": 260, \\\"okk\\\": 261, \\\"okie\\\": 262, \\\"nice\\\": 263, \\\"well\\\": 264, \\\"job\\\": 265, \\\"thank\\\": 266, \\\"its\\\": 267, \\\"k\\\": 268, \\\"okay\\\": 269, \\\"thing\\\": 270, \\\"things\\\": 271, \\\"why\\\": 272, \\\"use\\\": 273, \\\"practice\\\": 274, \\\"active\\\": 275, \\\"cases\\\": 276, \\\"here\\\": 277, \\\"against\\\": 278, \\\"juniors\\\": 279, \\\"history\\\": 280, \\\"incidents\\\": 281, \\\"table\\\": 282, \\\"academic\\\": 283, \\\"calander\\\": 284}\"}}"